function dy = difury(t, y)
    mu = 3.986004418E+14;   % конствнтва гравитационного поля Земли
    Rz = 6378136;           % экваториальный радиус Земли
    w_e = 7.292115E-05;      % угловая скорость вращения Земли
    C20 = -1082.62575E-06;  % коэффициент при второй зональной гармонике разложения геопотенциала в ряд по сферическим функциям
    t_G0 = (9*3600+18*60+10.5009+3*3600);
    t_G = t_G0 + w_e*(t- 3*3600);
    
    % Ускорения, принимаем постоянными на всем интервале расчета
    Ax = -.186264514923E-05;
    Ay = -.186264514923E-05;
    Az = -.186264514923E-05;

    JsumX = Ax*cos(t_G)-Ay*sin(t_G); 
    JsumY = Ax*sin(t_G)+Ay*cos(t_G);
    JsumZ = Az;
    
    dy = y(:);
    dy(1) = y(4);
    dy(2) = y(5);
    dy(3) = y(6);
    r = sqrt(y(1)*y(1)+y(2)*y(2)+y(3)*y(3));
    mu_ = mu/(r*r);
    x_ = y(1)/r;
    y_ = y(2)/r;
    z_ = y(3)/r;
    ro = Rz/r;
    dy(4) = -mu_*x_ + 3/2*C20*mu_*x_*ro^2*(1-5*z_^2) + JsumX;
    dy(5) = -mu_*y_ + 3/2*C20*mu_*y_*ro^2*(1-5*z_^2) + JsumY;
    dy(6) = -mu_*z_ + 3/2*C20*mu_*z_*ro^2*(3-5*z_^2) + JsumZ;
end