function y = proizv(t, yy)
    mu = 3.986004418E+14;   % конствнтва гравитационного поля Земли
    C_20 = -1082.62575E-06;  % коэффициент при второй зональной гармонике разложения геопотенциала в ряд по сферическим функциям
    R_z = 6378136;           % экваториальный радиус Земли
    omega_e = 7.292115E-05;      % угловая скорость вращения Земли
    t_G0 = (9*3600+18*60+10.5009+3*3600);
    t_G = t_G0 + omega_e*(t- 3*3600);
    
    % Ускорения, принимаем постоянными на всем интервале расчета
    Ax = .186264514923E-05;
    Ay = .931322574615E-06;
    Az = -.279396772385E-05;

    Jsum_x = Ax*cos(t_G)-Ay*sin(t_G); 
    Jsum_y = Ax*sin(t_G)+Ay*cos(t_G);
    Jsum_z = Az;
    
    y = yy(:);
    y(1) = yy(4);
    y(2) = yy(5);
    y(3) = yy(6);
    r = sqrt(yy(1)*yy(1)+yy(2)*yy(2)+yy(3)*yy(3));
    mu_ = mu/(r*r);
    x_ = yy(1)/r;
    y_ = yy(2)/r;
    z_ = yy(3)/r;
    ro = R_z/r;
    y(4) = -mu_*x_ + 3/2*C_20*mu_*x_*ro^2*(1-5*z_^2) + Jsum_x;
    y(5) = -mu_*y_ + 3/2*C_20*mu_*y_*ro^2*(1-5*z_^2) + Jsum_y;
    y(6) = -mu_*z_ + 3/2*C_20*mu_*z_*ro^2*(3-5*z_^2) + Jsum_z;
end